
/*
 desc : Calculation Algorithm Library
*/

#include "pch.h"


#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static CHAR THIS_FILE[] = __FILE__;
#endif


/* --------------------------------------------------------------------------------------------- */
/*                                           전역 변수                                           */
/* --------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------- */
/*                                           콜백 함수                                           */
/* --------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------- */
/*                                           내부 함수                                           */
/* --------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------- */
/*                                           외부 함수                                           */
/* --------------------------------------------------------------------------------------------- */

#ifdef __cplusplus
extern "C"
{
#endif

/*
 desc : It takes raw data as input and returns the final straightness (trend line) value.
 parm : in	- [in]  Original Data
		out	- [in]  Result Data
 retn : TRUE or FALSE
*/
API_EXPORT BOOL uvEng_Calc_GetStraightness(vector<DOUBLE> &in, vector<DOUBLE> &out)
{
	return uvCalc_GetStraightness(in, out);
}

#ifdef __cplusplus
}
#endif