// pch.cpp: 미리 컴파일된 헤더에 해당하는 소스 파일

#include "pch.h"

/* --------------------------------------------------------------------------------------------- */
/*                                           전역 변수                                           */
/* --------------------------------------------------------------------------------------------- */

LPG_CIEA	g_pstConfig	= NULL;

/* --------------------------------------------------------------------------------------------- */
/*                                           전역 함수                                           */
/* --------------------------------------------------------------------------------------------- */

/*
 desc : 엔진 내부 환경 파일 구조체 포인터 반환
 parm : None
 retn : 구조체 포인터 (공유 메모리 영역)
*/
LPG_CIEA GetConfig()
{
	return g_pstConfig;
}

/*
 desc : 엔진 동작이 데모로 동작하는지 여부
 parm : None
 retn : TRUE or FALSE
*/
BOOL IsRunDemo()
{
	if (!g_pstConfig)	return TRUE;
	return g_pstConfig->IsRunDemo();
}
